In [1]:
import pandas as pd
import numpy as np

In [3]:
book = pd.read_csv('Book1.csv')
book

   roll   name  age
0     1    one   11
1     2    two   22
2     3  three   33

In [4]:
book.head(2)

   roll name  age
0     1  one   11
1     2  two   22

In [8]:
book.tail(2)

   roll   name  age
1     2    two   22
2     3  three   33

In [9]:
book.describe()

       roll   age
count   3.0   3.0
mean    2.0  22.0
std     1.0  11.0
min     1.0  11.0
25%     1.5  16.5
50%     2.0  22.0
75%     2.5  27.5
max     3.0  33.0

In [10]:
book['roll'].max()

3

In [11]:
book['roll'][1]

2

In [12]:
book['roll'][1] = 20

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_14080\87736143.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  book['roll'][1] = 20

In [13]:
book

   roll   name  age
0     1    one   11
1    20    two   22
2     3  three   33